package standard.chapter01;

public class Start {
	
	/*
		## :pushpin: 자바란?
		- 썬 마이크로시스템즈에서 개발하여 1996년 1월에 공식적으로 발표한 객체지향 프로그래밍 언어이다.
		- 자바는 풍부한 클래스 라이브러리(Java API)를 통해 프로그래밍에 필요한 요소들을 기본적으로 지원하기 때문에, 개발자는 이 클래스 라이브러리만을 잘 활용해도 강력한 기능의 자바 프로그램을 작성할 수 있다.
		- 자바를 만든 개잘자들의 원래 목표는 가전제품에 탑재될 SW를 만드는 것이었다. 처음에는 C++을 확장해서 사용하려고 했지만 C++로는 부족하다는 것을 깨달았다. 그래서 C++의 장점을 도입하고, 단점을 보완한 새로운 언어를 개발하기에 이르렀다.
		- 여러 종류의 운영체제를 사용하는 컴퓨터들이 통신하는 인터넷이 등장하자 운영체제에 독립적인 프로그램을 만들었다.
		
		## :pushpin: 특징
		1. **운영체제에 독립적이다.** : 자바 프로그램은 운영체제나 하드웨어가 아닌 JVM하고만 통신하고, JVM이 자바 응용프로그램으로부터 전달받은 명령을 해당 운영체제가 이해할 수 있도록 변환하여 전달한다. 그래서 썬에서는 여러 운영체제에 설치할 수 있는 서로 다른 버전의 JVM을 제공하고 있다.
		2. **객체지향언어이다.** : 객체지향의 특징인 상속, 캡슐화, 다형성이 잘 적용된 언어다.
		3. **비교적 배우기 쉽다.**
		4. **자동 메모리 관리(Garbage Collection)** : 가비지 컬렉터가 자동적으로 메모리를 관리해주기 때문에, 프로그래머는 메모리를 따로 관리하지 않아도 된다. 개발자가 개발에 집중할 수 있도록 도와준다.
		5. **네트워크와 분산처리를 지원한다.** : 풍부하고 다양한 네트워크 프로그래밍 라이브러리(Java API)를 통해 비교적 짧은 시간에 네트워크 관련 프로그램을 쉽게 개발할 수 있도록 지원한다.
		6. **멀티쓰레드를 지원한다.** : 자바에서 개발되는 멀티쓰레드 프로그램은 시스템과는 관계없이 구현가능하며, 관련된 라이브러리가 제공되므로 구현이 쉽다. 여러 쓰레드에 대한 스케줄링은 자바 인터프리터가 담당한다.
		7. **동적로딩(Dynamic Loading)을 지원한다.** : 실행 시에 모든 클래스가 로딩되지 않고, 필요한 시점에 클래스를 로딩하여 사용할 수 있다. 일부 클래스가 변경되어도 전체 어플리케이션을 다시 컴파일하지 않아도 된다.
	*/
}
